Revit 2027 API
RoutingCondition Properties
The RoutingCondition type exposes the following members.
Properties
Name | Description
Diameter |  The diameter of the segment or fitting specified for the routing condition.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
RoutingCondition Class
Autodesk.Revit.DB Namespace